package com.mhasancse.firstaid.detailsActivity.prathomikaid;

import android.graphics.drawable.Drawable;
import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.text.Html;
import android.text.Spanned;
import android.widget.TextView;

import com.mhasancse.firstaid.R;

public class JointBathActivity extends AppCompatActivity {
    private final String htmlText =
            "<br>স্বাস্থ্য সচেতনতা, চিকিৎসা সুবিধা, খাদ্যাভ্যাস ইত্যাদি পরিবর্তনের ফলে দিনে দিনে মানুষের বয়স বৃদ্ধি পাচ্ছে। বয়স বাড়ার সাথে সাথে মানুষের শারীরিক ও মানসিক শক্তি এবং দেহ কোষের কর্মক্ষমতা বা সামর্থ্য ধীরে ধীরে কমতে থাকে। টিস্যুর এই সামর্থ্য ক্রমাবনতির হার বিভিন্ন ব্যক্তির ক্ষেত্রে বিভিন্ন অনুপাতে হয়। একজন ৮০ বছর বয়সের বৃদ্ধ যেমন কর্মক্ষম থাকতে পারেন, তেমনি আবার ৫০/৬০ বছর বয়সের ব্যক্তিরা ভুগতে পারেন বিভিন্ন ধরনের বার্ধক্যজনিত সমস্যা ও জয়েন্টের ব্যথায় যাকে আমরা সহজ ভাষায় বাত বলে জানি। সাধারণতঃ ৫০ বছর পর বয়সজনিত জয়েন্টের সমস্যা দেখা দেয়। আমাদের দেশে ৫০ ঊর্ধ্ব জনসংখ্যার শতকরা ৬৫ ভাগ লোক জয়েন্টের ব্যথাজনিত সমস্যায় ভোগেন।<br><br>" +


                    "<font color='#E91E63'><b>বয়স্করা সাধারণত যে সকল জয়েন্টের সমস্যায় ভোগেনঃ</b></font><br>" +
                    "মানুষের রোগের ভেতর ব্যথা বা যন্ত্রণা একটি অস্বস্তি ও কষ্টকর সমস্যা। আল্লাহতাআলা আমাদের শরীরে বিভিন্ন ধরনের জয়েন্ট বা সন্ধি স্বাভাবিক চলাচল এবং কর্মসম্পাদন করে জীবন নির্বাহের জন্য দিয়েছেন। সাধারণতঃ দুই বা দুইয়ের অধিক হাড় বা তরুণাস্থি শরীরের কোন এক যায়গায় সংযোগস্থাপনকারী টিসুøুর মাধ্যমে যুক্ত হয়ে একটি অস্থি সন্ধি বা জয়েন্ট তৈরি করে। আর এই সংযোগ স্থাপনকারী টিস্যুগুলো হচ্ছে মাংসপেশী, টেন্ডন, লিগামেন্ট, ক্যাপসুল, ডিস্ক, সাইনোভিয়াল পর্দা বা মেমব্রেন ইতাদি। এগুলো জয়েন্টকে শক্তি ও দৃঢ়তা প্রদান করে, জয়েন্ট-এর তল বা সারফেসসমূহকে মসৃণ বা পিচ্ছিল রাখে। এছাড়া মেরুদণ্ডের দুইটি হাড়ের মাঝে অবস্থিত ডিস্ক সক এবজরবার হিসাবে কাজ করে হাড়কে ক্ষয়ে যাওয়া থেকে রক্ষা করে। এইসব অস্থি বা জয়েন্টগুলোতে প্রধানত বয়স বাড়ার সাথে সাথে ক্ষয়, প্রদাহজনিত এবং আভ্যন্তরীণ পরিবর্তনের কারণে ব্যথা-বেদনা সৃষ্টি করে মানুষের চলাচল ও কাজকর্মে বিঘ্ন ঘটায়। বৃদ্ধ বয়সে প্রায় সকল সন্ধি বা জয়েন্টে কম-বেশি ব্যথার সমস্যা দেখা দিতে পারে। বিশেষ করে যেসব জয়েন্ট শরীরের ওজন বহন করে এবং অতিরিক্ত ব্যবহ্নত হয় যেমনঃ ঘাড়, কোমর ব্যথা, স্কন্ধ অস্থি সন্ধি বা সোল্ডার জয়েন্ট এবং হাটুর ব্যথার সবচেয়ে বেশি রোগী পাওয়া যায়।\n" +
                    "\n<br><br>" +


                    "<font color='#E91E63'><b>ঘাড়ে ব্যথা, চিকিৎসা ও পরামর্শঃ</b></font><br>" +
                    "ঘাড়ের ব্যথা বিভিন্ন কারণে হতে পারে, মূলতঃ ঘাড়ের মেরুদন্ডে যে হাড় ও জয়েন্ট আছে তা বয়স বাড়ার সাথে সাথে ব্যবহারের ফলে তাতে ক্ষয়জনিত পরিবর্তন ঘটে তার লিগামেন্টগুলো মোটা ও শক্ত হয়ে যায় এবং দুইটি হাড়ের মাঝে যে ডিস্ক থাকে তার উচ্চতা কমে এবং সরু হওয়া শুরু হয়। আবার অনেক সময় হাড়ের প্রান্তভাগে নতুন নতুন সূক্ষ্ম হাড়কণা জন্মায়। কোন কোন সময় দুইটি ভাট্রিব্রার বা মেরু হাড়ের মাঝে দূরত্ব কমে গিয়ে পাশে অবস্থিত স্নায়ুর উপর চাপ সৃষ্টি করে ব্যথার জন্ম দিতে পারে। অনেক সময় স্নায়ু রজ্জু সরু হয়ে যেতে পারে। ফলে ঘাড় ব্যথা ও নড়াচড়া করতে অসুবিধাসহ মাথা ব্যথা কিম্বা ব্যথা হাতের আঙ্গুল পর্যন্ত ছড়িয়ে যেতে পারে। দীর্ঘদিন এই ব্যথা অব্যাহত থাকলে ঘাড়ের মেরুদণ্ডের বিকৃতি বা স্পাইনাল ডিফরমিটি দেখা দিতে পারে। এই সমস্যাগুলোকে প্রকার ভেদে বিভিন্ন নামে নামকরণ করা হয় যেমনঃ সারভাইক্যাল স্পন্ডাইলোসিস, সারভাইক্যাল স্পন্ডাইলোসথোসিস, সারভাইক্যাল রিব, স্টিফ নেক, সারভাইক্যাল ইনজুরি ইত্যাদি।\n" +
                    "\n" +
                    "লক্ষণঃ সাধারণত এই সমস্ত রোগীরা ঘাড়ের ব্যথাসহ ঘাড় নড়াচড়া করা এবং হাতে ঝিন ঝিন অনুভব করার অসুবিধার কথা বর্ণনা করতে পারেন। অনেক ক্ষেত্রে হাতে শক্তি কমে যাওয়াসহ হাতের আঙ্গুলের বোধশক্তির তারতম্যের কথা বলতে পারে। ব্যথা ঘাড় হতে মাথার দিকে উঠতে পারে।" +


                    "<br><br><font color='#E91E63'><b>চিকিৎসাঃ</b></font><br>" +
                    "এই রোগের চিকিৎসার উদ্দেশ্য হলো ব্যথা কমানোর পাশাপাশি ঘাড়ের স্বাভাবিক নড়াচড়ার ক্ষমতা ফিরিয়ে আনা, ঘাড়ের মাংস পেশীর শক্তি বৃদ্ধি করা, ঘাড় বা স্পাইনের সঠিক পজিশন বা অবস্থা সম্পর্কে শিক্ষা দেয়া এবং যে সকল কারণে পুনরায় ঘাড় ব্যথা হতে পারে তা সম্পর্কে সচেতনতা সৃষ্টি করে সেভাবে চলার চেষ্টা করা। ব্যথা কমানোর জন্য সাধারণতঃ ব্যথানাশক ওষুধের পাশাপাশি ফিজিওথেরাপি চিকিৎসা এইসব রোগে অত্যন্ত কার্যকরী। বিশেষ করে পদ্ধতিগত ব্যায়াম যেমনঃ হাত দিয়ে মাথায় বিভিন্নভাবে চাপ দিয়ে ঘাড়ের মাংসপেশী শক্ত করা, দুই কাঁধ একত্রে উপরে উঠানো, হালকা বালিশ ব্যবহার করা ইত্যাদি। ফিজিওথেরাপিতে বিভিন্ন ধরনের বৈদ্যুতিক যন্ত্রপাতির সাহায্যে হিট চিকিৎসা, থেরাপিউটিক এক্সারসাইজ, মেনিপুলেশন এবং প্রয়োজন হলে ট্রাকশন এ রোগের উপকারে আসে। ঘাড়কে অপ্রয়োজনীয় নড়াচড়া থেকে বিরত এবং সাপোর্ট দেয়ার জন্য অনেক ক্ষেত্রে সারভাইক্যাল কলার ব্যবহার, মাথার নীচে হালকা নরম বালিশ ব্যবহার করা ইত্যাদি।" +

                    "<br><br><font color='#E91E63'><b>কোমর ব্যথার চিকিৎসা ও পরামর্শঃ</b></font><br>" +
                    "বার্ধ্যক্যজনিত বয়সে কোমরে ব্যথার প্রধান কারণ হচ্ছে কোমরের হাড় ও ইন্টারভার্টিব্রাল ডিস্ক এর ক্ষয় এবং কোমরের মাংস পেশীর দুর্বলতা। কোমর ব্যথার রোগগুলোকে আমরা, লো-ব্যাক পেইন/লাম্বার স্পন্ডাইলোসিস/ প্রোলাপস্\u200C ডিস্ক ইত্যাদি রোগ বলে থাকি। এই রোগের কারণ, প্রক্রিয়া ও চিকিৎসা ব্যবস্থা প্রায় ঘাড় ব্যথা বা সারভাইক্যাল স্পন্ডাইলোসিস এর অনুরূপ। তবে রোগীর শরীরের অবস্থান/ পোশ্চার সঠিকভাবে রক্ষার গুরুত্ব দিলে অনেক ক্ষেত্রে কোমরের ব্যথা এড়ানো সম্ভব। শক্ত বিছানায় শোয়া, কাত হয়ে বিছানায় শুতে যাওয়া, ওঠা, ভারী জিনিস বহন বা তোলা পরিহার করা, নিয়মিত কোমরের ব্যায়াম করা এবং অসমতল যায়গায় চলাচল না করা ইত্যাদি। কোমরের ব্যায়ামের ভিতরে উল্লেখযোগ্য চিত হয়ে শুয়ে হাঁটু ভাজ করে পিঠ দিয়ে বিছানায় চাপ দেয়া, একই অবস্থায় শুয়ে হাঁটু একত্রে এপাশ ওপাশ দেয়া, একই অবস্থায় শুয়ে এক পা এক পা করে হাঁটু ভাজ করে পেটের সাথে চাপ দেয়া ইত্যাদি। কোমরের ব্যথার রোগীরা ব্যথানাশক ওষুদের সাথে সাথে ফিজিওথেরাপিষ্ট-এর পরামর্শ মোতাবেক শর্টওয়েভ, আরট্রাসাউন্ট, আইএফটি কোমরের ব্যায়াম ও হাইড্রোথেরাপি অর্থাৎ পানিতে সাঁতার কাটলে উপকার পেতে পারেন।";
    //https://www.youtube.com/watch?v=SoVO3xOq4dg
    private TextView title, des;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main_design);

        //TitleBarView
        getSupportActionBar().setTitle("বয়স্কদের জয়েন্টর ব্যথাচিকিৎসা");
        getSupportActionBar().setDisplayHomeAsUpEnabled(true);

        //AppBarTitle
        title = (TextView) findViewById(R.id.intrTitleTV);
        Spanned text = Html.fromHtml("<font color='#E91E63'><b>১.৩ বয়স্কদের জয়েন্টর ব্যথাচিকিৎসা</b></font>");


        title.setText(text);
        des = (TextView) findViewById(R.id.titleDesTV);
        des.setText(Html.fromHtml(htmlText, new JointBathActivity.ImageGetter(), null));
    }

    @Override
    public boolean onSupportNavigateUp() {
        finish();
        return true;
    }

    private class ImageGetter implements Html.ImageGetter {

        public Drawable getDrawable(String source) {
            int id;

            if (source.equals("point.png")) {
                id = R.drawable.play;
            } else if (source.equals("multipoint.png")) {
                id = R.drawable.aid;
            } else {
                return null;
            }

            Drawable d = getResources().getDrawable(id);
            d.setBounds(0, 0, d.getIntrinsicWidth(), d.getIntrinsicHeight());
            return d;
        }
    }
}
